tap "autozimu/formulas"
tap "cantino/mcfly", "https://github.com/cantino/mcfly"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "mongodb/brew"
tap "stripe/stripe-cli"
tap "universal-ctags/universal-ctags"

brew "asdf"
brew "autoconf"
brew "autozimu/formulas/unison-fsmonitor"
brew "aws-elasticbeanstalk"
brew "bat"
brew "boost"
brew "ca-certificates"
brew "cairo"
brew "cantino/mcfly/mcfly"
brew "cgal"
brew "cmake"
brew "coreutils"
brew "direnv"
brew "docutils"
brew "emscripten"
brew "exa"
brew "exercism"
brew "fd"
brew "fzf"
brew "gcc"
brew "gd"
brew "gdal"
brew "gdk-pixbuf"
brew "geos"
brew "gh"
brew "git"
brew "git-delta"
brew "glib"
brew "gnu-sed"
brew "gnupg"
brew "gnutls"
brew "go"
brew "gobject-introspection"
brew "graphviz"
brew "groonga"
brew "guile"
brew "harfbuzz"
brew "heroku/brew/heroku"
brew "htop"
brew "hugo"
brew "hunspell"
brew "imagemagick"
brew "libavif"
brew "libheif"
brew "libidn2"
brew "libmng"
brew "libproxy"
brew "librsvg"
brew "lua"
brew "luajit"
brew "luarocks"
brew "luv"
brew "mariadb@10.2", restart_service: true, link: true
brew "memcached"
brew "mongodb/brew/mongodb-community"
brew "neovim"
brew "netcdf"
brew "netpbm"
brew "nghttp2"
brew "node"
brew "numpy"
brew "pango"
brew "poppler"
brew "poppler-qt5"
brew "postgis"
brew "postgresql@14"
brew "proj"
brew "python@3.10"
brew "python@3.8"
brew "python@3.9"
brew "qt"
brew "qt@5"
brew "redis", restart_service: true
brew "ripgrep"
brew "sfcgal"
brew "shared-mime-info"
brew "sqlite"
brew "stripe/stripe-cli/stripe"
brew "tmux"
brew "unbound"
brew "universal-ctags/universal-ctags/universal-ctags", args: ["HEAD"]
brew "viu"
brew "wxwidgets"
brew "zsh"
brew "zsh-syntax-highlighting"
cask "android-file-transfer"
cask "iina"
cask "kitty"
cask "maestral"
cask "vlc"
