tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "stripe/stripe-cli"
tap "universal-ctags/universal-ctags"

brew "asdf"
brew "autoconf"
brew "bat"
brew "boost"
brew "btop"
brew "ca-certificates"
brew "chafa"
brew "cmake"
brew "coreutils"
brew "direnv"
brew "docutils"
brew "exercism"
brew "eza"
brew "fd"
brew "fzf"
brew "gawk"
brew "gcc"
brew "gdal"
brew "geos"
brew "gettext"
brew "gh"
brew "git"
brew "git-delta"
brew "glib"
brew "gnu-sed"
brew "gnupg"
brew "gnutls"
brew "go"
brew "grpc"
brew "guile"
brew "harfbuzz"
brew "hdf5"
brew "htop"
brew "hugo"
brew "hunspell"
brew "imagemagick"
brew "jq"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
brew "lazygit"
brew "lua"
brew "luajit"
brew "luarocks"
brew "luv"
brew "mariadb@10.2", link: true
brew "neovim"
brew "node"
brew "numpy", link: false
brew "openssl@1.1"
brew "pango"
brew "pgsync"
brew "poppler"
brew "postgis"
brew "postgresql@13"
brew "postgresql@14", restart_service: true
brew "postgresql@15"
brew "postgresql@16"
brew "proj"
brew "protobuf"
brew "python@3.10"
brew "python@3.12"
brew "qt"
brew "qt@5"
brew "redis", restart_service: true
brew "ripgrep"
brew "rust"
brew "silicon"
brew "sqlite"
brew "stripe/stripe-cli/stripe"
brew "tmux"
brew "tree-sitter"
brew "unbound"
brew "universal-ctags", args: ["HEAD"]
brew "viu"
brew "webp"
brew "wget"
brew "z3"
brew "zsh"
brew "zsh-syntax-highlighting"

cask "android-file-transfer"
cask "iina"
cask "karabiner-elements"
cask "kitty"
cask "maccy"
cask "maestral"
cask "microsoft-edge"
cask "monitorcontrol"
cask "vlc"

vscode "bradlc.vscode-tailwindcss"
vscode "carakan.new-railscasts"
vscode "castwide.solargraph"
vscode "dakara.transformer"
vscode "danishsarwar.reverse-search"
vscode "dbaeumer.vscode-eslint"
vscode "dunstontc.viml"
vscode "esbenp.prettier-vscode"
vscode "github.vscode-pull-request-github"
vscode "glavin001.unibeautify-vscode"
vscode "jakebecker.elixir-ls"
vscode "jianbingfang.dupchecker"
vscode "karunamurti.haml"
vscode "koichisasada.vscode-rdbg"
vscode "mechatroner.rainbow-csv"
vscode "mjmcloug.vscode-elixir"
vscode "ms-ossdata.vscode-postgresql"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "naumovs.color-highlight"
vscode "octref.vetur"
vscode "pkief.material-icon-theme"
vscode "shopify.ruby-extensions-pack"
vscode "shopify.ruby-lsp"
vscode "sorbet.sorbet-vscode-extension"
vscode "vscodevim.vim"
