tap "autozimu/formulas"
tap "cantino/mcfly", "https://github.com/cantino/mcfly"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/services"
tap "stripe/stripe-cli"
tap "universal-ctags/universal-ctags"

brew "apache-arrow"
brew "asdf"
brew "autoconf"
brew "autozimu/formulas/unison-fsmonitor"
brew "aws-elasticbeanstalk"
brew "bat"
brew "boost"
brew "btop"
brew "ca-certificates"
brew "cantino/mcfly/mcfly"
brew "cgal"
brew "chafa"
brew "cmake"
brew "coreutils"
brew "direnv"
brew "docutils"
brew "exercism"
brew "eza"
brew "fd"
brew "fzf"
brew "gcc"
brew "gdal"
brew "gdk-pixbuf"
brew "geos"
brew "gh"
brew "git"
brew "git-delta"
brew "glib"
brew "gnu-sed"
brew "gnupg"
brew "gnutls"
brew "go"
brew "gobject-introspection"
brew "groonga"
brew "grpc"
brew "grpc@1.54"
brew "guile"
brew "harfbuzz"
brew "hdf5"
brew "heroku/brew/heroku"
brew "htop"
brew "hugo"
brew "hunspell"
brew "imagemagick"
brew "lazygit"
brew "libdap"
brew "libgeotiff"
brew "libgit2"
brew "libheif"
brew "librsvg"
brew "libssh2"
brew "lua"
brew "luajit"
brew "luarocks"
brew "luv"
brew "mariadb@10.2", link: true
brew "memcached"
brew "neovim"
brew "netcdf"
brew "nghttp2"
brew "node"
brew "node@16"
brew "numpy", link: false
brew "openssl@1.1"
brew "pango"
brew "pgsync"
brew "poppler"
brew "postgis"
brew "postgresql@13", restart_service: true
brew "postgresql@14"
brew "postgresql@15"
brew "proj"
brew "protobuf"
brew "python-tk@3.10"
brew "python@3.10"
brew "python@3.11"
brew "qt"
brew "qt@5"
brew "redis", restart_service: true
brew "ripgrep"
brew "rust"
brew "shared-mime-info"
brew "silicon"
brew "sqlite"
brew "stripe/stripe-cli/stripe"
brew "tmux"
brew "unbound"
brew "universal-ctags/universal-ctags/universal-ctags", args: ["HEAD"]
brew "viu"
brew "webp"
brew "wget"
brew "z3"
brew "zsh"
brew "zsh-syntax-highlighting"

cask "android-file-transfer"
cask "iina"
cask "kitty"
cask "maccy"
cask "maestral"
cask "microsoft-edge"
cask "vlc"
vscode "bradlc.vscode-tailwindcss"
vscode "carakan.new-railscasts"
vscode "castwide.solargraph"
vscode "dakara.transformer"
vscode "dbaeumer.vscode-eslint"
vscode "dunstontc.viml"
vscode "esbenp.prettier-vscode"
vscode "GitHub.vscode-pull-request-github"
vscode "Glavin001.unibeautify-vscode"
vscode "JakeBecker.elixir-ls"
vscode "jianbingfang.dupchecker"
vscode "karunamurti.haml"
vscode "mjmcloug.vscode-elixir"
vscode "naumovs.color-highlight"
vscode "octref.vetur"
vscode "PKief.material-icon-theme"
vscode "rebornix.ruby"
vscode "vscodevim.vim"
vscode "wingrunr21.vscode-ruby"
