bradlc.vscode-tailwindcss
carakan.new-railscasts
dbaeumer.vscode-eslint
eamodio.gitlens
fallenwood.vimL
GrapeCity.gc-excelviewer
JakeBecker.elixir-ls
karunamurti.haml
mjmcloug.vscode-elixir
ms-vsliveshare.vsliveshare
msjsdiag.debugger-for-chrome
naumovs.color-highlight
octref.vetur
pgourlain.erlang
PKief.material-icon-theme
rebornix.ruby
rust-lang.rust
shyykoserhiy.vscode-spotify
zhouronghui.propertylist
