bradlc.vscode-tailwindcss
carakan.new-railscasts
castwide.solargraph
dakara.transformer
dbaeumer.vscode-eslint
dunstontc.viml
eamodio.gitlens
GitHub.vscode-pull-request-github
JakeBecker.elixir-ls
jianbingfang.dupchecker
karunamurti.haml
mjmcloug.vscode-elixir
naumovs.color-highlight
octref.vetur
PKief.material-icon-theme
rebornix.ruby
vscodevim.vim
wingrunr21.vscode-ruby
